var u = require("../@babel/runtime/helpers/slicedToArray");
module.exports = {
  CELL_TYPES: {
    0: "磷酸铁锂",
    1: "三元锂",
    2: "钛酸锂",
    3: "钠离子"
  },
  ALARM_BITS: [
    [0, "严重过压"],
    [1, "严重欠压"],
    [2, "电池包移除"],
    [3, "电压线断线"],
    [4, "温度线断线"],
    [5, "AFE 通信失败"],
    [6, "单体压差过大"]
  ],
  PACK_BITS: [
    [3, "强制放电关闭"],
    [4, "强制充电开启"],
    [5, "强制充电关闭"],
    [6, "加热"],
    [8, "满充"],
    [11, "放电中"],
    [12, "充电中"],
    [14, "允许放电"],
    [15, "正式固件"]
  ],
  PARAMS: [
    [512, "电芯串数", "u16", "串"],
    [513, "电芯类型", "cellType", ""],
    [514, "AFE 数量", "u16", ""],
    [515, "客户编号", "u16", ""],
    [516, "固件版本", "version", ""],
    [517, "功能配置", "hex", ""],
    [518, "休眠延时", "u16", "s"],
    [519, "关机延时", "u16", "s"],
    [520, "额定充电电压", "u16x0.01", "V"],
    [521, "额定充电电流", "i16x0.01", "A"],
    [522, "满充电压", "u16", "mV"],
    [523, "满充电流", "u16", "mA"],
    [528, "过压保护", "u16", "mV"],
    [529, "过压恢复", "u16", "mV"],
    [535, "欠压保护", "u16", "mV"],
    [536, "欠压恢复", "u16", "mV"],
    [538, "放电过流 1", "u16", "A"],
    [544, "充电过流", "u16", "A"],
    [546, "充电高温", "i16", "℃"],
    [548, "充电低温", "i16", "℃"],
    [550, "放电高温", "i16", "℃"],
    [552, "放电低温", "i16", "℃"],
    [554, "MOS 高温", "i16", "℃"]
  ],
  decodeBits: function(e, r) {
    return r.filter((function(r) {
      var i = u(r, 1)[0];
      return 0 != (e & 1 << i)
    })).map((function(e) {
      return u(e, 2)[1]
    }))
  }
};